[settings]
;2052 = 0x0804
CodePage=2052
Language=Simplified Chinese
FontFace=宋体
FontHeight=9

[strings]
;==============================================================
; Common strings
;==============================================================
10000=杭州银行USBKey管理工具
10001=管理员版

;==============================================================
; Common Dialog box strings
;==============================================================
1=确定
2=取消
;==============================================================
; About Box
;==============================================================
100=关于杭州银行USBKey管理工具
101=关于杭州银行USBKey管理工具(&A)...
1057=杭州银行USBKey管理工具 V1.0
1058=开发者：EnterSafe\n\n
1064=http://www.EnterSafe.com
;==============================================================
; Main dlg
;==============================================================
;---Static string
;---can be enabled by ml_loadDlgStr
1005=查看证书信息(&V)
1006=修改用户PIN码(&P)
1007=删除...(&D)
1008=修改USBKey名(&T)
1009=系统选项(&O)
1011=初始化(&I)
1012=导出...(&E)
1013=解锁(&U)
1014=修改SO PIN(&G)
1015=登录(&L)
1037=导入...(&R)
1056=欢迎使用杭州银行USBKey管理工具。请先登录。
1062=查看属性显示->
1060=隐藏属性显示->
1072=显示全部PCKS#11属性
1122=全局密钥：

;--Alternative string
;--Set in controllers
30001=登出(&L)
30002=退出(&X)
30003=欢迎使用杭州银行USBKey管理工具。
30050=请先登录。

;--Set in list view
30004=数据域
30005=值
30006=属性名称
30007=属性值
30008=证书容器
30009=制造商
30010=标志
30011=硬件版本
30012=固件版本
30013=USBKey名称
30014=型号
30015=序列号
30016=最大PIN长度
30017=最小PIN长度
30018=公共数据区总空间
30019=公共数据区剩余空间
30020=秘密数据区总空间
30021=秘密数据区剩余空间
30022=可用于加密
30023=可用于验证
30024=可用于解密
30025=可用于签名
30026=是
30027=否
30044=算法标识
30045=加密块长度
30046=密钥长度
30047=干扰字符
30048=密钥访问权限标识
30051=容器名称
30052=证书名称
30053=证书ID
30054=证书序列号

;--Set in tree view
30028=USBKey列表
30029=签名用（只用于签名/验证）
30030=密钥交换用（用于加密/解密以及其他）
30031=公钥
30032=私钥
30033=数据
30055=证书

;==============================================================
; Login dlg
;==============================================================
;---Static string
;---can be enabled by ml_loadDlgStr
1041=PIN码：
1103=使用软键盘
;--Alternative string
30034=请输入PIN码：
30035=登录到 %s\r\n\r\n登录后，即可使用导入、删除等功能

;==============================================================
; Import dlg
;==============================================================
;---Static string
;---can be enabled by ml_loadDlgStr
1020=浏览
1022=新建容器（请勿使用'\'）：
1023=使用已有的容器：
1025=签名（只用于签名/验证）
1026=密钥交换（用于加密/解密以及其他）
1043=证书访问密码：
1104=用途
1105=选择容器
1106=选择要导入的文件
1119=导入文件中的全部证书
1120=只导入文件中的用户证书

;==============================================================
; SetPIN dlg
;==============================================================
;---Static string
;---can be enabled by ml_loadDlgStr
1046=原PIN码：
1047=新PIN码：
1048=确认：
1092=低
1093=中
1094=高
1096=检查强度
1101=使用软键盘
;--for set user PIN
30036=修改%s的PIN码
;--for set SO PIN
30037=修改%s的SO PIN
30038=原SO PIN：
30039=新SO PIN：
;--for unlock
30040=解锁 %s
30041=SO PIN：
30042=新用户PIN：
;---for export
30043=导出

;==============================================================
; Token name dlg
;==============================================================
;---can be enabled by ml_loadDlgStr
1049=请勿以空格结尾
;--Alternative string
30056=修改 %s 的名称

;==============================================================
; Low init dlg
;==============================================================
;---Static string
;---can be enabled by ml_loadDlgStr
1081=初始化参数
1082=USBKey名称：
1083=SO PIN：
1084=用户PIN码：
1085=SO PIN最大重试次数：
1086=用户PIN最大重试次数：
1087=公有数据区大小：
1088=私有数据区大小：
1089=预置RSA密钥对个数：
1091=超时(单位：分钟)：
1107=数据区大小总计不超过%d
1108=Pin码长度限制 (%d - %d位)
1110=Pin码重复次数限制 (%d - %d次)
1109=(不超过%d个)
1111=不超过%d分钟;设0表示不限制超时
1113=USBKey名称请勿以空格结尾
1125=输入您设置的全局密钥
1127=RSA密钥对数：
;==============================================================
; Message string
;==============================================================
;---Common string
33000=成功！
33001=失败！
33002=完毕！
33003=发生错误！
33039=是否继续？
33012=是否重新尝试？您还有%d次机会 
33013=重新登录后即可继续使用
33014=两次输入的新PIN码不一致，请重新输入
33038=您只剩下一次机会
33056=假如再次输入错误的PIN码，将被锁定
33057=假如再次输入错误的SO PIN，将被锁定

;---Operation string
33005=登录中，请稍等...
33006=正在导入，请不要拔出USBKey！
33007=正在删除，请不要拔出USBKey！
33008=正在初始化，请不要拔出USBKey！
33009=即将删除所选的%d个对象
33010=即将删除所选的容器以及容器中的所有数据\r\n删除后，容器中的证书和密钥对都将无法使用
33011=即将删除所选的USBKey中的所有数据\r\n删除后，所有容器、证书以及密钥都将无法使用
;---注意英文后面有空格
33067=删除
33068=导入
33069=导出
33070=修改PIN码
33071=修改USBKey名称
33072=解锁
33073=初始化
33074=修改SO PIN

;---notice string
33015=USBKey中已经存在相同的证书。
33016=确定要退出吗？
33017=PIN码不正确
33018=SO PIN不正确
33019=您只剩下一次机会。\r\n假如再次输入错误的PIN码，将被锁定
33020=您只剩下一次机会。\r\n假如再次输入错误的SO PIN，将被锁定
33021=原PIN码不正确
33022=原SO PIN不正确
33023=Please input new user PIN.
33024=Please input new SO PIN
33025=使用前请正确地安装%s
33026=每个USBKey存储的证书不能多于%d个
33027=请选择要使用的USBKey
33028=请选择要删除的对象
33029=请选择要导入的证书文件
33030=请登录USBKey
33031=请选择要查看的证书
33032=请选择要使用的容器
33033=请选择要导入的文件
33034=请使用 %d 位- %d 位的SO PIN
33035=请使用 %d 位- %d 位的PIN码
33036=请选择要导出的证书
33037=请确认所有参数都已设置为有效的值

;---Error message
33040=USBKey中没有足够的空间存储证书
33041=要导入的文件不存在
33042=不支持的证书格式
33043=USBKey仅仅支持%d位及以下的RSA密钥对
33044=导入密钥对失败
33045=导入证书失败
33046=用户PIN码被锁定
33047=USBKey被拔出，请插入
33048=证书解析失败，可能是访问密码错误
33049=数据格式错误
33050=新PIN码过长
33051=新SO PIN过长
33052=用户PIN码被锁定
33053=SO PIN码被锁定
33054=USBKey被写保护
33055=如果所选的容器中存有相同用途的证书或密钥，将被替换
33058=不支持导入PFX格式的根证书
33059=USBKey状态改变
33060=不同格式的证书不能混装，请选择其他容器
33061=即将初始化所选的USBKey\r\nUSBKey中的所有数据，包括容器、证书以及密钥都将被清除
33062=容器中的数据缺少与证书匹配的密钥对，请重新选择容器或创建新的容器
33063=导入的证书将会替换已有的证书: %s
33075=您还有%d次重试的机会
33076=数据区总体大小不应超过%d
33077=USBKey超时
33078=容器中存在相同的证书或密钥，请选择其他容器或新建容器
33079=[需要更新]
33080=相同的容器已经存在。是否使用已有的容器？
33081=请保留要初始化的USBKey并拔除其他的USBKey
33082=两次输入的用户PIN码不一致，请重新输入
33083=两次输入的SO PIN不一致，请重新输入
33084=令牌仅仅支持%ld-%ld位之间RSA密钥对
33085=操作失败，卡片是写保护的！
